Revit 2027 API
Gutter.GutterType Property
Retrieves/set an object that represents the type of the Gutter.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public GutterType GutterType { get; set; }
Public Property GutterType As GutterType
	Get
	Set
public:
property GutterType^ GutterType {
	GutterType^ get ();
	void set (GutterType^ value);
}
member GutterType : GutterType with get, set
Property Value
GutterType
See Also
Reference
Gutter Class
Autodesk.Revit.DB.Architecture Namespace